Amiya200/stm32_water_tank/Core/Src/screen.c
        lcd_line0("Paired OK!");
        snprintf(l1, sizeof(l1), "%08lX", (unsigned long)did);
        lcd_line1(l1);
        return;
    }

    if (pairingTimedOut)
    {
        lcd_line0("Pairing Failed");
        lcd_line1("SELECT=Back");
        return;
    }

    if (pairingInProgress)
    {
        uint8_t cnt = LoRa_GetDiscoveredCount();

        if (cnt == 0)
        {
            lcd_line0("Searching TX...");
            lcd_line1("RESET=Cancel");
            return;
        }

        if (discoveredIndex >= cnt)
            discoveredIndex = 0;

        LoRa_DiscoveredDevice_t d;

        if (LoRa_GetDiscoveredDevice(discoveredIndex, &d))
        {
            snprintf(l0, sizeof(l0), "TX %u/%u R:%d",
                     (unsigned)(discoveredIndex + 1),
                     (unsigned)cnt,
                     (int)d.rssi);

            snprintf(l1, sizeof(l1), "%08lX SEL",
                     (unsigned long)d.did);

            lcd_line0(l0);
            lcd_line1(l1);
            return;
        }

        lcd_line0("Device Error");
        lcd_line1("RESET=Back");
        return;
    }

    uint8_t pairedCnt = PairedDev_Count();

    snprintf(l0, sizeof(l0), "Pair TX %u/%u",
             (unsigned)pairedCnt,
             (unsigned)MAX_PAIRED);

    lcd_line0(l0);
    lcd_line1(pairedCnt >= MAX_PAIRED ? "Full Remove1st" : "SELECT=Start");
}


static void show_add_device_remove(void)
{
    uint8_t cnt = PairedDev_Count();
    char l0[17], l1[17];
    if (cnt == 0) { lcd_line0("No TX Paired"); lcd_line1("Back>"); return; }
    uint8_t idx = addDevTypeIndex % cnt;
    uint32_t did = PairedDev_Get(idx);
    char hex[9]; snprintf(hex, sizeof(hex), "%08lX", (unsigned long)did);
    snprintf(l0, sizeof(l0), "Remove %u/%u:", idx + 1, cnt);
    snprintf(l1, sizeof(l1), ">%.8s Del?>", hex);
    lcd_line0(l0); lcd_line1(l1);
}

static void show_add_device_pair_done(void)
{
    uint32_t did = LoRa_GetLastPairedDID();
    char hex[9]; snprintf(hex, sizeof(hex), "%08lX", (unsigned long)did);
    lcd_line0("Paired OK!"); lcd_line1(hex);
}

static void show_add_device_remove_done(void)
{
    uint8_t cnt = PairedDev_Count(); char l1[17];
    lcd_line0("TX Removed");
    snprintf(l1, sizeof(l1), "%u TX remaining", cnt); lcd_line1(l1);
}

static void show_reset_confirm(void)
{
    lcd_line0("Reset To Default?");
    lcd_line1(reset_confirm_yes ? "YES       Apply>" : "NO        Back>");
}

/* ════════════════════════════════════════════════════════════════════
 *  SETTINGS HELPERS
 * ════════════════════════════════════════════════════════════════════ */
static void apply_settings_core(void)
{
    uint16_t gap_s = 0;
    if (edit_settings_dry_en && edit_settings_gap_s > 0)
        gap_s = (uint16_t)(edit_settings_gap_s * 60U);
    ModelHandle_SetUserSettings(gap_s, ModelHandle_GetRetryCount(),
        edit_settings_uv, edit_settings_ov,
        edit_settings_ol, edit_settings_ul, edit_settings_maxrun);
    uint32_t retry_s = (edit_settings_retry > 0)
                       ? (uint32_t)edit_settings_retry * 60U : 10U;
    ModelHandle_SetDryRunTime(retry_s);
    ModelHandle_SetDryRun(edit_settings_dry_en && edit_settings_gap_s > 0);
}

static void start_settings_edit_flow(void)
{
    uint16_t gap_s = ModelHandle_GetGapTime();
    if (gap_s == 0) edit_settings_gap_s = 0;
    else
    {
        edit_settings_gap_s = gap_s / 60;
        if (edit_settings_gap_s < 1)   edit_settings_gap_s = 1;
        if (edit_settings_gap_s > 180) edit_settings_gap_s = 180;
    }
    edit_settings_dry_en = ModelHandle_GetDryRunEnable() ? 1 : 0;
    {
        uint16_t dry_s = ModelHandle_GetDryRunRetryGap();
        edit_settings_retry = (dry_s == 0) ? 5 : (uint8_t)(dry_s / 60);
        if (edit_settings_retry < 1)   edit_settings_retry = 1;
        if (edit_settings_retry > 180) edit_settings_retry = 180;
    }
    edit_settings_uv = ModelHandle_GetUnderVolt();
    if (edit_settings_uv && edit_settings_uv < 150) edit_settings_uv = 150;
    if (edit_settings_uv > 200) edit_settings_uv = 200;
    edit_settings_ov = ModelHandle_GetOverVolt();
    if (edit_settings_ov && edit_settings_ov < 250) edit_settings_ov = 250;
    if (edit_settings_ov > 300) edit_settings_ov = 300;
    edit_settings_ol = (int)ModelHandle_GetOverloadLimit();
    if (edit_settings_ol > 25) edit_settings_ol = 25;
    edit_settings_ul = (int)ModelHandle_GetUnderloadLimit();
    if (edit_settings_ul > 10) edit_settings_ul = 10;
    edit_settings_maxrun = ModelHandle_GetMaxRunTime();
    if (edit_settings_maxrun > 300) edit_settings_maxrun = 300;
    edit_settings_pwrrest = ModelHandle_GetPowerRestoreMode();
    edit_settings_factory_yes = false;
    RTC_GetTimeDate();
    edit_date_dd = time.dom; edit_date_mm = time.month; edit_date_yyyy = time.year;
    edit_date_field = 0;
    edit_time_hh = time.hour; edit_time_min = time.min; edit_time_field = 0;
    edit_day_idx2 = (time.dow >= 1 && time.dow <= 7) ? (uint8_t)((time.dow - 1) % 7) : 0;
    devset_idx = 0; devset_view_top = 0;
    ui = UI_DEVSET_MENU; screenNeedsRefresh = true;
}

static void goto_menu_top(void) { menu_idx = 0; menu_view_top = 0; }

/* ════════════════════════════════════════════════════════════════════
 *  MENU SELECT (SELECT button handler)
 * ════════════════════════════════════════════════════════════════════ */
static void menu_select(void)
{
    refreshInactivityTimer();

    if (ui == UI_WELCOME) { ui = UI_DASH; screenNeedsRefresh = true; return; }
    if (ui == UI_DASH)    { goto_menu_top(); ui = UI_MENU; screenNeedsRefresh = true; return; }

    if (ui == UI_MENU)
    {
        switch (menu_idx)
        {
            case 0:
                addDevMenuIndex = 0; addDevTypeIndex = 0;
                pairingInProgress = false; pairingComplete = false; pairingTimedOut = false;
                ui = UI_ADD_DEVICE_MENU; break;
            case 1: start_settings_edit_flow(); return;
            case 2: reset_confirm_yes = false; ui = UI_RESET_CONFIRM; break;
        }
        screenNeedsRefresh = true; return;
    }

